# Questão 1

In [75]:
import pandas as pd

serie1 = pd.Series([2, 7, 5, 10, 6, 20])
serie2 = pd.Series([3, 4, 5, 6, 7, 8])

print(f'Soma: \n{serie1+serie2}\nSubtração: \n{serie1-serie2}\nMultiplicação: \n{serie1*serie2}\nDivisão: \n{serie1/serie2}')

Soma:
0     5
1    11
2    10
3    16
4    13
5    28
dtype: int64
Subtração:
0    -1
1     3
2     0
3     4
4    -1
5    12
dtype: int64
Multiplicação:
0      6
1     28
2     25
3     60
4     42
5    160
dtype: int64
Divisão:
0    0.666667
1    1.750000
2    1.000000
3    1.666667
4    0.857143
5    2.500000
dtype: float64

# Questão 2

In [76]:
import numpy as np
import pandas as pd

array = np.array([1, 2, 3, 4, 5])
serie = pd.Series(array)

print(f'Array: {array}')
print(f'Serie: \n{serie}')

Array: [1 2 3 4 5]
Serie:
0    1
1    2
2    3
3    4
4    5
dtype: int32

# Questão 3

In [77]:
import pandas as pd

dicionario = {'a': 1, 'b': 2, 'c': 3}

serie = pd.Series(dicionario)

print(f'Serie: \n{serie}')

Serie:
a    1
b    2
c    3
dtype: int64

# Questão 4

In [78]:
import pandas as pd

serie = pd.Series([1, 2, 3, 4, 5])
array = list(serie)

print(array)

[1, 2, 3, 4, 5]

# Questão 5

In [79]:
import pandas as pd

serie = pd.Series([1, 2, 5, 4, 3])

print(f'Serie ordenada: \n{serie.sort_values()}')

Serie ordenada:
0    1
1    2
4    3
3    4
2    5
dtype: int64

# Questão 6

In [80]:
import pandas as pd

dataFrame = pd.DataFrame([['78', '84', '86'], ['85', '94', '97'], ['96', '89', '96'], ['80', '83', '72'], ['86', '86', '83']], columns=['X', 'Y', 'Z'])

dataFrame

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

# Questão 7

In [81]:
import pandas as pd

dataFrame = pd.DataFrame([["Anastasia", 12.5, 1, "yes"], ["Dimas", 9.0, 3, "no"], ["Katherine", 16.5, 2, "yes"], ["James", 10.3, 3, "no"], ["Emily", 9.0, 2, "no"], ["Michael", 20.0, 3, "yes"], ["Matthew", 14.5, 1, "yes"], ["Laura", 8.2, 1, "no"], ["Kevin", 8.0, 2, "no"], ["Jonas", 19.0, 1, "yes"]], columns=["name", "score", "attempts", "qualify"], index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

dataFrame

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b      Dimas    9.0         3      no
c  Katherine   16.5         2     yes
d      James   10.3         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    8.2         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# 7) a)

In [82]:
dataFrame[dataFrame['attempts'] > 2]

      name  score  attempts qualify
b    Dimas    9.0         3      no
d    James   10.3         3      no
f  Michael   20.0         3     yes

# 7) b)

In [83]:
dataFrame[dataFrame['score'] < 10.0]

    name  score  attempts qualify
b  Dimas    9.0         3      no
e  Emily    9.0         2      no
h  Laura    8.2         1      no
i  Kevin    8.0         2      no

# 7) c)

In [84]:
dataFrame[dataFrame['qualify'] == 'yes']

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
j      Jonas   19.0         1     yes

# 7) d)

In [85]:
dataFrame[['name', 'score']]

        name  score
a  Anastasia   12.5
b      Dimas    9.0
c  Katherine   16.5
d      James   10.3
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    8.2
i      Kevin    8.0
j      Jonas   19.0

# 7) e)

In [86]:
[dataFrame['score'].mean(), dataFrame['score'].mode()]

[12.7,
 0    9.0
 Name: score, dtype: float64]

# 7) f)

In [87]:
dataFrame.sort_values(by='score', ascending=False)

        name  score  attempts qualify
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
d      James   10.3         3      no
b      Dimas    9.0         3      no
e      Emily    9.0         2      no
h      Laura    8.2         1      no
i      Kevin    8.0         2      no

# 7) g)

In [88]:
print(f"Pontuação: \n{dataFrame['score'].describe()}")
print(f"Tentativa: \n{dataFrame['attempts'].describe()}")

Pontuação:
count    10.00000
mean     12.70000
std       4.54826
min       8.00000
25%       9.00000
50%      11.40000
75%      16.00000
max      20.00000
Name: score, dtype: float64
Tentativa:
count    10.000000
mean      1.900000
std       0.875595
min       1.000000
25%       1.000000
50%       2.000000
75%       2.750000
max       3.000000
Name: attempts, dtype: float64